In [7]:
# "Obtener la diferencia entre el salario más alto y el más bajo.

import numpy as np
import pandas as pd

diccionario = {
    
    "Nombre":["Juan","Elena","Santiago","Fernando","Miriam","Julio"],
    "Edad" : [29,27,23,35,28,30],
    "Salario": [18000,25000,28000,10500,21000,27000],
    "Genero": ["M","F","M","M","F","M"]

}

datos=pd.DataFrame(diccionario)
datos

     Nombre  Edad  Salario Genero
0      Juan    29    18000      M
1     Elena    27    25000      F
2  Santiago    23    28000      M
3  Fernando    35    10500      M
4    Miriam    28    21000      F
5     Julio    30    27000      M

In [8]:
#Obtener el valor minimo y maximo 
SalMinimo = datos["Salario"].min()
SalMaximo = datos["Salario"].max()


print("El salario menor es ", SalMinimo)
print("El salario mayor es ", SalMaximo)

El salario menor es  10500
El salario mayor es  28000

In [9]:
#obtenemos la diferencia
difSalarios = SalMaximo - SalMinimo

print ("la diferencia es de ", difSalarios )

la diferencia es de  17500

# Actividad Avanzada

In [11]:
# Obtener los estadísticos descriptivos de los salarios. (media, mediana, desviación estándar, etc..

datos["Salario"].describe()

count        6.000000
mean     21583.333333
std       6606.183972
min      10500.000000
25%      18750.000000
50%      23000.000000
75%      26500.000000
max      28000.000000
Name: Salario, dtype: float64